REGISTRATION_STARTED_MESSAGE = "Привет! 👋 \n" \
                               "Я СИГМА.CarPool бот для совместных поездок до офиса и\или дома. \n" \
                               "Чтобы принять участие, нужно заполнить анкету из нескольких вопросов.\n" \
                               "Вы всегда можете изменить данные профиля."

WHATS_YOUR_NAME_QUESTION = "Как вас зовут?"

WHATS_YOUR_PHONE_NUMBER_QUESTION = "Введите ваш контактный номер"

DRIVER_EXPERIENCE_QUESTION = "Какой у вас стаж вождения? Пример: 1 год 6 " \
                             "месяцев"

LESS_THAN_ONE_YEAR_EXPERIENCE_WARNING = "В виду высокой степени " \
                                        "ответственности мы не рекомендуем " \
                                        "водителям со стажем менее года " \
                                        "брать попутчиков, но если вы " \
                                        "считаете, что у вас достаточно " \
                                        "мастерства - все отлично!"

WHICH_STATIONS_WILL_BE_PASSED_QUESTION = "Какие станции метро вы " \
                                         "проезжаете?\n" \
                                         "Введите их по очереди\n" \
                                         "Пример: Лесная, Выборгская, Площадь Ленина"

HOW_MANY_FREE_SLOTS_QUESTION = "Сколько у вас свободных мест в машине для " \
                               "пассажиров?"

WHERE_ARE_PASSENGER_LIVING_QUESTION = "На какой станции метро вы " \
                                      "проживаете?\n" \
                                      "Пример: Лесная"

HOW_WILL_BENEFIT_QUESTION = "Чем вы можете быть полезны как пассажир?\n" \
                            "Например: Куплю вкусный кофе!\n" \
                            "Хороший собеседник"

BECAME_A_PASSENGER = "Стать пассажиром"

ALL_OK = "Все отлично! Продолжить"

ARE_YOU_EMPLOYED_QUESTION = "Вы являетесь сотрудником компании СИГМА?"

ARENT_EMPLOYED_MESSAGE = "Пользоваться ботом могут только сотрудники " \
                         "компании СИГМА. До свидания!"

SUCCESSFULLY_QUIZZED = "Вы успешно справились с входным опросом!"

REGISTRARION_ENDED_MESSAGE = "Поздравляем! Регистрация завершена. Что вы хотите сделать?"

NO_AVIABLE_RIDES_MESSAGE = "Доступных поездок не найдено\nЧто вы хотите сделать?"

WHICH_FIELD_TO_CHANGE = "Какое именно поле вы хотите поменять?"

ENTER_NEW_VALUE_MESSAGE = "Введите новое значение"

SUCCESSFULLY_CHANGED_MESSAGE = "Успешно!"

CHOOSE_DIRECTION_MESSAGE = "Выберите направление поездки"

CHOOSE_DATE_MESSAGE = "Выберите дату поездки"

ADD_COMMENT_MESSAGE = "Хотите добавить что-то еще в отношение поездки?"

CONFIRM_DETAILS_MESSAGE = "Все ли верно?"
